# import sql library

In [3]:
import pandas as pd
import sqlite3

In [5]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
%sql sqlite://

# SQl table 1

In [8]:
%%sql
create table Employee(Emp_id varchar(10) PRIMARY KEY, First name varchar(50) not null, Last name varchar(50), Address varchar(50) not null, title char(25) not null, Salary number(10) not null, Hire_date DATE)

 * sqlite://
Done.

[]

In [12]:
%%sql
SELECT * FROM employee;

 * sqlite://
Done.

[]

In [17]:
%%sql
insert into Employee values ('emp03', 'rani', 'singh', '43 law gate', 'tester',77000,'2020-06-18');
insert into Employee values ('emp04', 'kittu', 'singh', '43 law gate', 'desiner',57000,'2020-03-04');
insert into Employee values ('emp05', 'Aman', 'singh', '43 law gate', 'developer',67000,'2020-08-07');
insert into Employee values ('emp06', 'riya', 'singh', '43 law gate', 'tester',74000,'2020-03-04');
insert into Employee values ('emp07', 'Ayush', 'singh', '43 law gate', 'tester',47000,'2020-09-13');
insert into Employee values ('emp08', 'Nupur', 'singh', '43 law gate', 'developer',37000,'2020-0-19');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [18]:
%%sql
SELECT * FROM employee;

 * sqlite://
Done.

[('emp01', 'komal', 'singh', '43 law gate', 'developer', 67000, '2020-12-16'),
 ('emp02', 'rani', 'singh', '43 law gate', 'developer', 77000, '2020-06-18'),
 ('emp03', 'rani', 'singh', '43 law gate', 'tester', 77000, '2020-06-18'),
 ('emp04', 'kittu', 'singh', '43 law gate', 'desiner', 57000, '2020-03-04'),
 ('emp05', 'Aman', 'singh', '43 law gate', 'developer', 67000, '2020-08-07'),
 ('emp06', 'riya', 'singh', '43 law gate', 'tester', 74000, '2020-03-04'),
 ('emp07', 'Ayush', 'singh', '43 law gate', 'tester', 47000, '2020-09-13'),
 ('emp08', 'Nupur', 'singh', '43 law gate', 'developer', 37000, '2020-0-19')]

# sql table 2

In [20]:
%%sql
create table Employee2(Emp_id varchar(10) PRIMARY KEY, city_cover varchar(50) not null, Contact_number number(10) not null, Age int,
    CHECK (Age>=18) );

 * sqlite://
Done.

[]

In [27]:
%%sql

insert into Employee2 values ('emp03', 'kanpur', 8051557283,24);
insert into Employee2 values ('emp04', 'jalandher', 8051557283,22);
insert into Employee2 values ('emp05', 'chandighar', 8051557283,29);
insert into Employee2 values ('emp06', 'patna', 8051557283,26);
insert into Employee2 values ('emp07', 'Delhi', 8051557283,30);
insert into Employee2 values ('emp08', 'kanpur', 8051557283,31);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [29]:
%%sql
SELECT * FROM employee2;

 * sqlite://
Done.

[('emp01', 'Delhi', 8051557283, 21),
 ('emp02', 'Delhi', 8051557283, 21),
 ('emp03', 'kanpur', 8051557283, 24),
 ('emp04', 'jalandher', 8051557283, 22),
 ('emp05', 'chandighar', 8051557283, 29),
 ('emp06', 'patna', 8051557283, 26),
 ('emp07', 'Delhi', 8051557283, 30),
 ('emp08', 'kanpur', 8051557283, 31)]

# inner join

In [39]:
%%sql
select Employee.first,Employee.last,Employee2.city_cover from Employee INNER JOIN Employee2 ON Employee.Emp_id = Employee2.Emp_id;

 * sqlite://
Done.

[('komal', 'singh', 'Delhi'),
 ('rani', 'singh', 'Delhi'),
 ('rani', 'singh', 'kanpur'),
 ('kittu', 'singh', 'jalandher'),
 ('Aman', 'singh', 'chandighar'),
 ('riya', 'singh', 'patna'),
 ('Ayush', 'singh', 'Delhi'),
 ('Nupur', 'singh', 'kanpur')]

# view

In [41]:
%%sql
CREATE VIEW DetailsView AS
SELECT first, last, title 
FROM Employee;
WHERE Emp_id = emp05;

 * sqlite://
(sqlite3.OperationalError) table DetailsView already exists
[SQL: CREATE VIEW DetailsView AS
SELECT first, last, title
FROM Employee;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [43]:
%%sql
SELECT * FROM DetailsView;

 * sqlite://
Done.

[('komal', 'singh', 'developer'),
 ('rani', 'singh', 'developer'),
 ('rani', 'singh', 'tester'),
 ('kittu', 'singh', 'desiner'),
 ('Aman', 'singh', 'developer'),
 ('riya', 'singh', 'tester'),
 ('Ayush', 'singh', 'tester'),
 ('Nupur', 'singh', 'developer')]

# like clause

In [48]:
%%sql
select * from Employee where title like '__v%';

 * sqlite://
Done.

[('emp01', 'komal', 'singh', '43 law gate', 'developer', 67000, '2020-12-16'),
 ('emp02', 'rani', 'singh', '43 law gate', 'developer', 77000, '2020-06-18'),
 ('emp05', 'Aman', 'singh', '43 law gate', 'developer', 67000, '2020-08-07'),
 ('emp08', 'Nupur', 'singh', '43 law gate', 'developer', 37000, '2020-0-19')]

# Order by clause

In [51]:
%%sql
select * from Employee order by salary;

 * sqlite://
Done.

[('emp08', 'Nupur', 'singh', '43 law gate', 'developer', 37000, '2020-0-19'),
 ('emp07', 'Ayush', 'singh', '43 law gate', 'tester', 47000, '2020-09-13'),
 ('emp04', 'kittu', 'singh', '43 law gate', 'desiner', 57000, '2020-03-04'),
 ('emp01', 'komal', 'singh', '43 law gate', 'developer', 67000, '2020-12-16'),
 ('emp05', 'Aman', 'singh', '43 law gate', 'developer', 67000, '2020-08-07'),
 ('emp06', 'riya', 'singh', '43 law gate', 'tester', 74000, '2020-03-04'),
 ('emp02', 'rani', 'singh', '43 law gate', 'developer', 77000, '2020-06-18'),
 ('emp03', 'rani', 'singh', '43 law gate', 'tester', 77000, '2020-06-18')]

In [52]:
%%sql
select * from Employee order by salary desc;

 * sqlite://
Done.

[('emp02', 'rani', 'singh', '43 law gate', 'developer', 77000, '2020-06-18'),
 ('emp03', 'rani', 'singh', '43 law gate', 'tester', 77000, '2020-06-18'),
 ('emp06', 'riya', 'singh', '43 law gate', 'tester', 74000, '2020-03-04'),
 ('emp01', 'komal', 'singh', '43 law gate', 'developer', 67000, '2020-12-16'),
 ('emp05', 'Aman', 'singh', '43 law gate', 'developer', 67000, '2020-08-07'),
 ('emp04', 'kittu', 'singh', '43 law gate', 'desiner', 57000, '2020-03-04'),
 ('emp07', 'Ayush', 'singh', '43 law gate', 'tester', 47000, '2020-09-13'),
 ('emp08', 'Nupur', 'singh', '43 law gate', 'developer', 37000, '2020-0-19')]